import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;

/**
 * Пусть дан список сотрудников:
 *
 * - Иван Иванов
 * - Светлана Петрова
 * - Кристина Белова
 * - Анна Мусина
 * - Анна Крутова
 * - Иван Юрин
 * - Петр Лыков
 * - Павел Чернов
 * - Петр Чернышов
 * - Мария Федорова
 * - Марина Светлова
 * - Мария Савина
 * - Мария Рыкова
 * - Марина Лугова
 * - Анна Владимирова
 * - Иван Мечников
 * - Петр Петин
 * - Иван Ежов
 *
 * Написать программу, которая найдет и выведет повторяющиеся имена с количеством повторений. Отсортировать по убыванию популярности.
 *
 */
public class Main {
    private static List<String> employeer = new ArrayList<>(){{
        "Иван Иванов",
        "Светлана Петрова",
        "Кристина Белова",
        "Анна Мусина",
        "Анна Крутова",
        "Иван Юрин",
        "Петр Лыков",
        "Павел Чернов",
        "Петр Чернышов",
        "Мария Федорова",
        "Марина Светлова",
        "Мария Савина",
        "Мария Рыкова",
        "Марина Лугова",
        "Анна Владимирова",
        "Иван Мечников",
        "Петр Петин",
        "Иван Ежов"
        }};

    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}